unittests/messagereader/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.27seconds.com/Holidays/US/Dates/">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:GetEaster>
         <dat:year>2011</dat:year>
      </dat:GetEaster>
   </soapenv:Body>
</soapenv:Envelope>